# Day 1

**Video 1 : Pandas Apa itu Series Membuat Series dari List**

In [0]:
a = [1, 2, 3, 4, 8, 10]

In [0]:
import pandas as pd

In [0]:
obj_series = pd.Series(a)

In [0]:
type(obj_series)

In [0]:
obj_series

In [0]:
a

In [0]:
obj_series.values

In [0]:
obj_series.index

In [0]:
a[1:4]

In [0]:
obj_series[1:4]

**Video 2 : Pandas Apa Itu Series Perbedaan List dan Series**

In [0]:
print(obj_series)

In [0]:
print(a)

In [0]:
obj_series = pd.Series([1, 3, 5], index=['a', 'b', 'c'])

In [0]:
obj_series

In [0]:
obj_series['b']

**Video 3 : Pandas Apa Itu Series Perbedaan Dictionary dan Series**

In [0]:
obj_dict = {
    'a' : 1,
    'b' : 2,
    'a' : 10
}

In [0]:
obj_dict

{'a': 10, 'b': 2}

In [0]:
# obj_series = pd.Series([1, 2, 10], index=['a', 'b', 'a'])
obj_series = pd.Series([1, 2, 10], index=['a', 'b', 'c'])

In [0]:
obj_series['a':'b']

a    1
b    2
dtype: int64

**Video 4 : Membaca dan Membuat Data**

In [0]:
df = pd.read_csv('namafile')

# Day 2

**Video 1 : Belajar Data Science Pandas Series Memilih dan Mengindex Data 1**

In [0]:
import pandas as pd

In [0]:
a = pd.Series([1, 3, 5, 7], index=['a', 'b', 'c', 'd'])

In [0]:
a

In [0]:
a.keys()

In [0]:
list(a.items())

In [0]:
for key, value in a.items():
  print(key)
  print(value)

In [0]:
a['c']

In [0]:
a[0:2]

**Video 2 : Belajar Data Science Pandas Series Memilih dan Mengindex Data 2**

In [0]:
a.loc['a':'c']

In [0]:
a.iloc[0:3]

**Video 3 : Belajar Data Science Pandas DataFrame Memilih dan Mengindex Data 1**

In [0]:
area = pd.Series({
    'California': 423967, 
    'Texas': 695662,
    'New York': 141297,
    'Florida': 170312,
    'Illinois': 149995
})

pop = pd.Series({
    'California': 38332521, 
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 170312,
    'Illinois': 12882135
})

data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312    170312
Illinois    149995  12882135

In [0]:
data['area']

In [0]:
type(data['area'])

In [0]:
type(data[['area']])

In [0]:
data[['area']]

In [0]:
# Error
# data.area 123 
data.area

In [0]:
data['area'] is data.area

**Video 4 : Belajar Data Science Pandas DataFrame Memilih dan Mengindex Data 2**

In [0]:
data.loc['Texas':'Florida', 'area':'pop']

In [0]:
data.iloc[2:5, 1:]

In [0]:
data.iloc[2:5, :]

**Video 5 : Belajar Data Science Pandas DataFrame Filter Data Dengan Logic Operator**

In [0]:
data['pop'] > 20000000

In [0]:
pop_15jt_lbh = data['pop'] > 15000000
area_150rb_lbh = data['area'] > 15000

In [0]:
pop_15jt_lbh

In [0]:
area_150rb_lbh

In [0]:
data[(pop_15jt_lbh) & (area_150rb_lbh)]

In [0]:
data[(pop_15jt_lbh) | (area_150rb_lbh)]

**Video 6 : Belajar Data Science Pandas Data Transformasi**

In [0]:
def pop_5(x):
  z = x + 0.2 * x
  return z

In [0]:
data[['pop']].apply(pop_5)

In [0]:
data

In [0]:
data['pop_5'] = data[['pop']].apply(pop_5)

In [0]:
data

# Day 3

**Video 1 : Belajar Pandas : Mengubah Struktur Data dengan Teknik Pivoting**

In [0]:
import pandas as pd

In [0]:
penjualan = {
    'toko':['Bandung','Garut','Jakarta','Garut','Bandung','Jakarta'],
    'Barang':['Telur','Telur','Telur','Minyak','Minyak','Minyak'],
    'Hasil':[200000,300000,150000,100000,120000,400000]
}

In [0]:
df = pd.DataFrame(penjualan)

In [0]:
df

In [0]:
df.pivot_table?

In [0]:
df.pivot_table(index='toko', columns='Barang', values='Hasil')

In [0]:
penjualan2 = {
    'toko':['Bandung','Garut','Jakarta','Garut','Bandung','Jakarta'],
    'Barang':['Telur','Telur','Telur','Minyak','Minyak','Minyak'],
    'Hasil':[240000,320000,200000,300000,150000,200000]
}

In [0]:
df2 = pd.DataFrame(penjualan2)

In [0]:
df2

In [0]:
df_gabung = df.append(df2, ignore_index=True)

In [0]:
df_gabung

       toko  Barang   Hasil
0   Bandung   Telur  200000
1     Garut   Telur  300000
2   Jakarta   Telur  150000
3     Garut  Minyak  100000
4   Bandung  Minyak  120000
5   Jakarta  Minyak  400000
6   Bandung   Telur  240000
7     Garut   Telur  320000
8   Jakarta   Telur  200000
9     Garut  Minyak  300000
10  Bandung  Minyak  150000
11  Jakarta  Minyak  200000

In [0]:
# aggfunc default mean
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil')

In [0]:
# aggfunc = sum
df_gabung.pivot_table(index='toko', columns='Barang', values='Hasil', aggfunc='sum')

Barang   Minyak   Telur
toko
Bandung  270000  440000
Garut    400000  620000
Jakarta  600000  350000

**Video 2 : Belajar Pandas : Mengubah Struktur Data dengan Teknik Melting**

In [0]:
penjualan = {
    'toko':['Bandung','Garut','Jakarta','Garut','Bandung','Jakarta'],
    'Barang':['Telur','Telur','Telur','Minyak','Minyak','Minyak'],
    'Hasil':[200000,300000,150000,100000,120000,400000]
}

penjualan2 = {
    'toko':['Bandung','Garut','Jakarta'],
    'Telur':[200000,300000,150000],
    'Minyak':[120000,100000,400000]
}

In [0]:
original_df = pd.DataFrame(penjualan)
current_df = pd.DataFrame(penjualan2)

In [0]:
original_df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3    Garut  Minyak  100000
4  Bandung  Minyak  120000
5  Jakarta  Minyak  400000

In [0]:
current_df

      toko   Telur  Minyak
0  Bandung  200000  120000
1    Garut  300000  100000
2  Jakarta  150000  400000

In [0]:
current_df.melt()

  variable    value
0     toko  Bandung
1     toko    Garut
2     toko  Jakarta
3    Telur   200000
4    Telur   300000
5    Telur   150000
6   Minyak   120000
7   Minyak   100000
8   Minyak   400000

In [0]:
current_df.melt?

In [0]:
current_df.melt(id_vars=['toko'])

      toko variable   value
0  Bandung    Telur  200000
1    Garut    Telur  300000
2  Jakarta    Telur  150000
3  Bandung   Minyak  120000
4    Garut   Minyak  100000
5  Jakarta   Minyak  400000

In [0]:
current_df.melt(id_vars=['toko'], value_vars=['Telur'])

In [0]:
current_df.melt(id_vars=['toko'], value_vars=['Telur', 'Minyak'])

      toko variable   value
0  Bandung    Telur  200000
1    Garut    Telur  300000
2  Jakarta    Telur  150000
3  Bandung   Minyak  120000
4    Garut   Minyak  100000
5  Jakarta   Minyak  400000

In [0]:
current_df.melt(id_vars=['toko'], value_vars=['Telur', 'Minyak'], var_name='Barang', value_name='Hasil')

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3  Bandung  Minyak  120000
4    Garut  Minyak  100000
5  Jakarta  Minyak  400000

In [0]:
original_df

      toko  Barang   Hasil
0  Bandung   Telur  200000
1    Garut   Telur  300000
2  Jakarta   Telur  150000
3    Garut  Minyak  100000
4  Bandung  Minyak  120000
5  Jakarta  Minyak  400000

# Day 4

**Video 1 : Belajar Pandas : Menggroup kan data**

In [0]:
import pandas as pd

In [0]:
penjualan = {
    'Hari':['Hari-1']*6+['Hari-2']*6,
    'toko':['Bandung','Garut','Jakarta','Garut','Bandung','Jakarta','Bandung','Garut','Jakarta','Garut','Bandung','Jakarta'],
    'Barang':['Telur','Telur','Telur','Minyak','Minyak','Minyak','Telur','Telur','Telur','Minyak','Minyak','Minyak'],
    'Pendapatan_Kotor':[200000,300000,150000,100000,120000,400000,240000,320000,200000,300000,150000,200000],
    'Pendapatan_Bersih':[80000,100000,50000,50000,50000,200000,120000,150000,120000,100000,110000,90000]
}

In [0]:
df = pd.DataFrame(penjualan)
df

      Hari     toko  Barang  Pendapatan_Kotor  Pendapatan_Bersih
0   Hari-1  Bandung   Telur            200000              80000
1   Hari-1    Garut   Telur            300000             100000
2   Hari-1  Jakarta   Telur            150000              50000
3   Hari-1    Garut  Minyak            100000              50000
4   Hari-1  Bandung  Minyak            120000              50000
5   Hari-1  Jakarta  Minyak            400000             200000
6   Hari-2  Bandung   Telur            240000             120000
7   Hari-2    Garut   Telur            320000             150000
8   Hari-2  Jakarta   Telur            200000             120000
9   Hari-2    Garut  Minyak            300000             100000
10  Hari-2  Bandung  Minyak            150000             110000
11  Hari-2  Jakarta  Minyak            200000              90000

In [0]:
# Kita ingin mengetahui pendapatan bersih dan bersih berdasarkan hari
df.groupby('Hari')

In [0]:
# Aggregation contoh sum, std, min, max
df.groupby('Hari').sum()

In [0]:
df.groupby(['Hari','toko'])

In [0]:
df.groupby(['Hari','toko']).sum()

**Video 2 : Belajar Pandas : Grouping Data dan Aggregasi Data**

In [0]:
# Group by multiple columns
# secara default semua column mengalami aggregation
df.groupby('Hari').mean()

In [0]:
# group by dengan kolom tertentu
# df.groupby('Hari')[['Pendapatan_Kotor','Pendapatan_Bersih']].mean()
df.groupby('Hari')[['Pendapatan_Kotor']].mean()

In [0]:
# Group by multiple aggregation
# melakukan banyak aggregation
df.groupby('Hari')[['Pendapatan_Kotor','Pendapatan_Bersih']].agg(['mean','sum'])

       Pendapatan_Kotor          Pendapatan_Bersih
                   mean      sum              mean     sum
Hari
Hari-1    211666.666667  1270000      88333.333333  530000
Hari-2    235000.000000  1410000     115000.000000  690000

In [0]:
# Group by with custom function
# membuat aggregation sendiri
def diff_min_max(x):
  return x.max() - x.min()

df.groupby('Hari')[['Pendapatan_Kotor','Pendapatan_Bersih']].agg(['mean',diff_min_max])

In [0]:
# Custom aggregation with dictionaries
# dapat melakukan aggregation yang berbeda setiap kolom
df.groupby('Hari')[['Pendapatan_Kotor','Pendapatan_Bersih']].agg({'Pendapatan_Kotor':'sum','Pendapatan_Bersih':diff_min_max})

        Pendapatan_Kotor  Pendapatan_Bersih
Hari
Hari-1           1270000             150000
Hari-2           1410000              60000

# Day 5

**Video 1 : Belajar Pandas : Menggabungkan Data**

In [0]:
import pandas as pd

In [0]:
# Dummy Data 1
dummy_data1 = {
    'id':['1','2','3','4','5'],
    'Feature1':['A','C','E','G','I'],
    'Feature2':['B','D','F','H','J']
}

df1 = pd.DataFrame(dummy_data1, columns=['id','Feature1','Feature2'])
df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [0]:
# Dummy Data 2
dummy_data2 = {
    'id':['1','2','6','7','8'],
    'Feature1':['K','M','O','Q','S'],
    'Feature2':['L','N','P','R','T']
}

df2 = pd.DataFrame(dummy_data2, columns=['id','Feature1','Feature2'])
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [0]:
# Dummy Data 3
dummy_data3 = {
    'id':['1','2','3','4','5','7','8','9','10','11'],
    'Feature3':[12,13,14,15,16,17,15,12,13,23]
}

df3 = pd.DataFrame(dummy_data3, columns=['id','Feature3'])
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [0]:
# Menggabungkan data 1 dan data 2, pada row
df_list = [df1,df2]
pd.concat(df_list)
# index tidak unique

In [0]:
pd.concat(df_list,ignore_index=True)
# index unique

In [0]:
# menggabungkan data pada column
pd.concat(df_list,ignore_index=True,axis=1)
# axis digunakan untuk menggabungkan berdasarkan kolom
# secara default bernilai 0 dan berdasarkan baris
# Jika digabung berdasarkan kolom maka tidak perlu ignore_index

In [0]:
# digabung berdasarkan kolom dan tanpa ignore_index
pd.concat(df_list,axis=1)

**Video 2 : Belajar Pandas : Menggabungkan Data 2**

In [0]:
# menggabungkan data dengan berbagai logic penggabungan
# seperti inner join, outer join, dsb
# pd.merge()

In [0]:
df12 = pd.concat(df_list)

In [0]:
df12

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [0]:
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [0]:
# on digunakan jika kolomnya sama antara data yang lain
pd.merge(df12, df3, on='id')

In [0]:
df3.columns = ['idkey', 'Feature']
df3

In [0]:
# jika kolom berbeda masih
pd.merge(df12, df3, left_on='id', right_on='idkey')

  id Feature1 Feature2 idkey  Feature
0  1        A        B     1       12
1  1        K        L     1       12
2  2        C        D     2       13
3  2        M        N     2       13
4  3        E        F     3       14
5  4        G        H     4       15
6  5        I        J     5       16
7  7        Q        R     7       17
8  8        S        T     8       15

In [0]:
# menggabungkan data berdasarkan logic penggabungan
# outer join
# inner join
# left join
# right join

In [0]:
# outer join, menggabungkan semua data
pd.merge(df1, df2, on='id', how='outer')
# how untuk mendefinisikan logic penggabungan apa yang ingin digunakan

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  3          E          F        NaN        NaN
3  4          G          H        NaN        NaN
4  5          I          J        NaN        NaN
5  6        NaN        NaN          O          P
6  7        NaN        NaN          Q          R
7  8        NaN        NaN          S          T

In [0]:
df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [0]:
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [0]:
# inner join, menggabungkan data yang beririsan aja
pd.merge(df1, df2, on='id', how='inner')

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N

In [0]:
# left join, menghasilkan semua id yang berasal dari data 1
pd.merge(df1, df2, on='id', how='left')

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  3          E          F        NaN        NaN
3  4          G          H        NaN        NaN
4  5          I          J        NaN        NaN

In [0]:
# right join, menghasilkan semua id yang berasal dari data 2
pd.merge(df1, df2, on='id', how='right')

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  6        NaN        NaN          O          P
3  7        NaN        NaN          Q          R
4  8        NaN        NaN          S          T